Revit 2027 API
NavisworksExportScope Enumeration
 An enumerated type listing possible "Element Scopes" of Navisworks Exporter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum NavisworksExportScope
Public Enumeration NavisworksExportScope
public enum class NavisworksExportScope
type NavisworksExportScope
Members
Member name | Value | Description
Model | 0 |  Export all elements in the document.
SelectedElements | 2 |  Export the selected elements.
View | 1 |  Export the elements in a view.
See Also
Reference
Autodesk.Revit.DB Namespace